# -*- ii: ii; -*-
#+TITLE: Windows Subsystem for Linux Setup
#+AUTHOR: James Blair
#+EMAIL: mail@jamesblair.net
#+DATE: 1st September 2019


This guide will walk through setting up [[https://en.wikipedia.org/wiki/Windows_Subsystem_for_Linux][Windows Subsystem for Linux]] on Windows 10.  This particular setup contains my opinionated view of a good foundation and layers on some pairing and development orientated tooling over top.

*Caveats:* Please note this guide is written for the [[https://www.microsoft.com/en-us/p/debian/9msvkqc78pk6][Debian WSL distribution]].

*Acknowledgements:* Large elements of this wsl setup came about through collaboration with the great people at [[https://ii.coop][ii.coop]].  I encourage you to explore and contribute to their work on [[https://gitlab.ii.coop][gitlab]] as many elements form a core part of this setup and workflow.


** Step 2 - Update and install packages

   To get started we ensure the package manager is up to date.

   #+NAME: Update system packages
   #+BEGIN_SRC shell
   sudo apt-get update && sudo apt-get upgrade
   #+END_SRC


   Next we install a series of standard packages that form part of our workflow or are dependencies for other tools in our environment.

   #+NAME: Install standard packages 
   #+BEGIN_SRC shell
   # Install basic utilities
    sudo apt-get install -y git locales curl wget xclip xsel tmux tmate net-tools less wget htop screenfetch zip openssh-client dictd knockd
  
   # Install pre-requisites for compiling emacs
   sudo apt-get install -y make gcc libgnutls28-dev libtinfo-dev
  
   # Install dpkg and apt management tools
   sudo apt-get install -y software-properties-common apt-transport-https ca-certificates dirmngr

   # Install terminal customisation packages
   sudo apt install -y xterm xtermcontrol
   #+END_SRC


   We use [[https://docker.io][docker]] to run containers or kind (kubernetes in docker) locally.
   
   #+NAME: Install docker
   #+begin_src shell
   # Download and add Docker's official public PGP key.
   curl -fsSL https://download.docker.com/linux/ubuntu/gpg | sudo apt-key add -

   # Add the `stable` channel's Docker upstream repository.
   sudo add-apt-repository \
   "deb [arch=amd64] https://download.docker.com/linux/debian \
   $(lsb_release -cs) \
   stable"

   # Update the apt package list (for the new apt repo).
   sudo apt-get update -y
   
   # Install the latest version of Docker CE.
   sudo apt-get install -y docker-ce

   # Allow your user to access the Docker CLI without needing root access.
   sudo usermod -aG docker $USER
   #+end_src 

   #+RESULTS: Install docker
   #+begin_example
   #+end_example


   We use [[https://pandoc.org/][pandoc]] for documentation export from spacemacs and other markup conversion tasks.

   #+NAME: Install pandoc
   #+BEGIN_SRC shell
   # Work from our downloads folder
   cd ~/Downloads

   # Download the latest release from github
   curl -s https://api.github.com/repos/jgm/pandoc/releases/latest \
   | grep "browser_download_url.*deb" \
   | cut -d : -f 2,3 \
   | tr -d \" \
   | wget -i -
   
   # Install the package with dpkg
   sudo dpkg -i pandoc*
   
   # Remove the package file after install
   rm pandoc*
   #+END_SRC


   For additional package management we use [[https://www.npmjs.com/][node package manager]]. The code below installs node ~12~.

   #+NAME: Install node
   #+BEGIN_SRC shell 
   # Curl down the shell script for adding version 12 of nodejs to apt
   sudo curl  -sL https://deb.nodesource.com/setup_12.x | sudo bash -
   
   # Install the nodejs package via apt
   sudo apt-get install -y nodejs
   #+END_SRC

  
   For managing secrets we use [[https://bitwarden.com/][bitwarden]] which provides a great [[https://github.com/bitwarden/cli][cli utility]].

   This section should be expanded in future to cover setting alias for common bitwarden tasks.

   #+NAME: Install bitwarden and login
   #+BEGIN_SRC shell
   # Install the bitwarden cli via node package manager
   sudo npm install -g @bitwarden/cli 

   # Test login to bitwarden
   bw login mail@jamesblair.net
   #+END_SRC


   For working with google cloud platform we use the [[https://cloud.google.com/sdk/][GCP SDK]], which provides our cli tools.

   #+NAME: Install google cloud sdk
   #+BEGIN_SRC shell
   # Add the Cloud SDK distribution URI as a package source: 
   echo "deb [signed-by=/usr/share/keyrings/cloud.google.gpg] https://packages.cloud.google.com/apt cloud-sdk main" | sudo tee -a /etc/apt/sources.list.d/google-cloud-sdk.list

   # Import the Google Cloud public key: 
   curl https://packages.cloud.google.com/apt/doc/apt-key.gpg | sudo apt-key --keyring /usr/share/keyrings/cloud.google.gpg add -

   # Update then install the Google Cloud SDK & kubectl: 
   sudo apt-get update && sudo apt-get install -y google-cloud-sdk kubectl
   #+END_SRC
   
   For working with [[https://aws.com][Amazon Web Services]] we need the [[https://docs.aws.amazon.com/cli/latest/userguide/install-cliv2-linux.html][AWS CLI]].

   #+NAME: Install amazon web services cli
   #+BEGIN_SRC shell
   # Download the binary
   cd ~/Downloads/
   curl "https://awscli.amazonaws.com/awscli-exe-linux-x86_64.zip" -o "awscliv2.zip"
   
   # Install
   unzip awscliv2.zip 
   sudo ./aws/install 
   
   # Clean up
   rm -rf ~/Downloads/aws*
   #+END_SRC 

   For cloud infrastructure deployments we use [[https://www.terraform.io/][terraforms]].

   #+NAME: Install hashicorp terraforms
   #+BEGIN_SRC shell
   # Download the binary
   wget 'https://releases.hashicorp.com/terraform/0.12.24/terraform_0.12.24_linux_amd64.zip'

   # Unzip it
   unzip *.zip

   # Move the binary to path
   sudo mv terraform /usr/local/bin/

   # Clean up
   rm *amd64.zip 
   #+END_SRC


   For ad-hoc system administration we use [[https://deb.nodesource.com/setup_12.x ][ansible]].

   #+NAME: Install ansible
   #+BEGIN_SRC shell
   # Add a source entry to apt sources
   echo 'deb http://ppa.launchpad.net/ansible/ansible/ubuntu trusty main' | sudo tee -a /etc/apt/sources.list
   
   # Add the required key
   sudo apt-key adv --keyserver keyserver.ubuntu.com --recv-keys 93C4A3FD7BB9C367
   
   # Install ansible via apt package manager
   sudo apt-get update && sudo apt-get install -y ansible
   #+END_SRC

   
